// =================================================================================================
// ====================================================================================== Flange.cpp
//
// Conducción de calor en régimen no estacionario
//
// ================================================================= Copyright © 2025 Alberto Escrig
// =================================================================================================

import VF;
import std;

// -------------------------------------------------------------------------------------- Constantes

constexpr double Δt      = 0.005,
                 ΔtWrite = 0.1,
                 tFin    = 3.0;

constexpr double α = 4e-5;

int main()
{
// ------------------------------------------------------------------------------------------- Malla

VF::TMalla3D::Read("Flange.msh");

// ------------------------------------------------------------------------------------------ Campos

VF::TCampoEscalar3D T;

// ------------------------------------------------------------------------- Condiciones de contorno

T.DefCC<VF::TDirichlet>("hot",  573.0);
T.DefCC<VF::TDirichlet>("cold", 273.0);

// --------------------------------------------------------------------------- Condiciones iniciales

T = 273.0;

for (double t = Δt; t < tFin + Δt; t += Δt)
  {
// ---------------------------------------------------------------------------------------- Solución

  solve(Δ(T) / Δt - α * lap(T) == 0, T); // Euler implícito
  // solve(Δ(T) / Δt - 0.5 * α * lap(T) == 0.5 * α * lap(T), T); // Crank-Nicolson
  // solve(Δ(T) / Δt == α * lap(T), T); // Euler explícito

// -------------------------------------------------------------------------------------- Resultados

  if (std::fmod(t, ΔtWrite) < Δt)
    {
    static int i = 0;

    std::ofstream ofs(std::format("resu{:02d}.vtk", i++));

    VF::TMalla3D::Write(ofs);
    T.Write(ofs, "T");
    }
  }

return 0;
}
